{
  "posts": [
    {
      "0": {
        "id": "10bfa018-c88d-4f1b-b66c-5dbcf414da78",
        "en": {
          "name": "Ignition System ",
          "content": "The ignition system is a crucial component in an internal combustion engine, responsible for igniting the air-fuel mixture to start the engine and keep it running. There are several types of ignition systems, but they all serve the same basic purpose. Below is an overview of the main components and functions of a typical ignition system:",
          "mainComponents": "1.\tBattery: Provides the electrical power needed to start the engine.\n2.\tIgnition Coil: Converts the low-voltage power from the battery to high-voltage power.\n3.\tDistributor: Distributes the high-voltage power to the spark plugs in the correct firing order.\n4.\tSpark Plugs: Ignite the air-fuel mixture in the engine's cylinders.\n5.\tIgnition Switch: Allows the driver to turn the ignition system on and off.\n6.\tControl Module: Manages the timing and operation of the ignition system.\n",
          "functions": "1.\tVoltage Transformation: The ignition coil transforms the low voltage from the battery to the high voltage required to create a spark.\n2.\tSpark Timing: The control module or distributor ensures that the spark occurs at the right time for each cylinder.\n3.\tSpark Distribution: The distributor or control module sends the high-voltage spark to the correct spark plug.\n4.\tIgnition: The spark plugs ignite the air-fuel mixture, causing combustion and powering the engine.\n",
          "images": []
        },
        "vi": {
          "name": "HỆ THỐNG ĐÁNH LỬA",
          "content": "Hệ thống đánh lửa là một thành phần quan trọng trong động cơ đốt trong, chịu trách nhiệm đốt cháy hỗn hợp không khí-nhiên liệu để khởi động động cơ và duy trì hoạt động của nó. Có nhiều loại hệ thống đánh lửa, nhưng tất cả đều phục vụ mục đích cơ bản giống nhau. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống đánh lửa điển hình:",
          "mainComponents": "1.\tẮc Quy: Cung cấp năng lượng điện cần thiết để khởi động động cơ.\n2.\tCuộn Đánh Lửa: Chuyển đổi nguồn điện áp thấp từ ắc quy thành điện áp cao.\n3.\tBộ Phân Phối Điện: Phân phối điện áp cao đến các bugi theo thứ tự đánh lửa chính xác.\n4.\tBugi: Đốt cháy hỗn hợp không khí-nhiên liệu trong các xi lanh của động cơ.\n5.\tCông Tắc Đánh Lửa: Cho phép người lái bật và tắt hệ thống đánh lửa.\n6.\tBộ Điều Khiển: Quản lý thời điểm và hoạt động của hệ thống đánh lửa.",
          "functions": "1.\tBiến Đổi Điện Áp: Cuộn đánh lửa biến đổi điện áp thấp từ ắc quy thành điện áp cao cần thiết để tạo ra tia lửa.\n2.\tĐiều Chỉnh Thời Gian Đánh Lửa: Bộ điều khiển hoặc bộ phân phối đảm bảo rằng tia lửa xảy ra đúng thời điểm cho mỗi xi lanh.\n3.\tPhân Phối Tia Lửa: Bộ phân phối hoặc bộ điều khiển gửi tia lửa điện áp cao đến bugi đúng.\n4.\tĐánh Lửa: Các bugi đốt cháy hỗn hợp không khí-nhiên liệu, gây ra sự cháy và tạo năng lượng cho động cơ.",
          "images": []
        }
      },
      "1": {
        "id": "1a4cf6cb-beb9-4e87-b689-5db5b12da317",
        "en": {
          "name": "Brake System",
          "content": "The brake system is an essential safety feature in any vehicle, responsible for slowing down or stopping the vehicle. The effectiveness and reliability of the brake system are critical for vehicle safety. Below is an overview of the main components and functions of a typical brake system:",
          "mainComponents": "1.\tBrake Pedal: The driver applies force to the brake pedal to initiate the braking process.\n2.\tMaster Cylinder: Converts the force from the brake pedal into hydraulic pressure.\n3.\tBrake Lines: Carry the hydraulic fluid from the master cylinder to the brake calipers or wheel cylinders.\n4.\tBrake Calipers: Clamp the brake pads against the rotors to create friction and slow down the vehicle (in disc brake systems).\n5.\tBrake Pads: Create friction against the rotors to slow down the vehicle.\n6.\tBrake Rotors: The discs that the brake pads clamp onto to create the necessary friction.\n7.\tBrake Drums: Used in drum brake systems; the brake shoes press against the drum to create friction.\n8.\tBrake Shoes: Press against the brake drums to slow down the vehicle.\n9.\tBrake Fluid: The hydraulic fluid that transmits force from the master cylinder to the brake calipers or wheel cylinders.\n10.\tAnti-lock Braking System (ABS): Prevents the wheels from locking up during hard braking to maintain steering control.",
          "functions": "1.\tForce Transmission: The brake pedal applies force to the master cylinder, creating hydraulic pressure.\n2.\tHydraulic Pressure Distribution: The master cylinder distributes hydraulic pressure through the brake lines to the calipers or wheel cylinders.\n3.\tFriction Generation: The brake pads or shoes create friction against the rotors or drums to slow down the vehicle.\n4.\tHeat Dissipation: The rotors and drums dissipate heat generated during braking to prevent overheating.\n5.\tSafety Enhancement: The ABS system enhances safety by preventing wheel lock-up and maintaining vehicle control during hard braking.",
          "images": []
        },
        "vi": {
          "name": "HỆ THỐNG PHANH",
          "content": "Hệ thống phanh là một tính năng an toàn quan trọng trong bất kỳ phương tiện nào, chịu trách nhiệm làm chậm hoặc dừng xe. Hiệu quả và độ tin cậy của hệ thống phanh là cực kỳ quan trọng đối với sự an toàn của phương tiện. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống phanh điển hình:",
          "mainComponents": "1.\tBàn Đạp Phanh: Người lái xe tác động lực lên bàn đạp phanh để bắt đầu quá trình phanh.\n2.\tXi Lanh Chính: Chuyển đổi lực từ bàn đạp phanh thành áp suất thủy lực.\n3.\tĐường Dẫn Phanh: Chuyển dẫn chất lỏng thủy lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n4.\tCaliper Phanh: Kẹp các má phanh vào các đĩa phanh để tạo ra ma sát và làm chậm xe (trong hệ thống phanh đĩa).\n5.\tMá Phanh: Tạo ma sát với các đĩa phanh để làm chậm xe.\n6.\tĐĩa Phanh: Các đĩa mà má phanh kẹp vào để tạo ra ma sát cần thiết.\n7.\tTrống Phanh: Được sử dụng trong hệ thống phanh tang trống; các guốc phanh ép vào trống để tạo ma sát.\n8.\tGuốc Phanh: Ép vào trống phanh để làm chậm xe.\n9.\tDầu Phanh: Chất lỏng thủy lực truyền lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n10.\tHệ Thống Chống Bó Cứng Phanh (ABS): Ngăn chặn các bánh xe bị khóa cứng trong quá trình phanh mạnh để duy trì khả năng điều khiển lái.",
          "functions": "1.\tTruyền Lực: Bàn đạp phanh tác động lực lên xi lanh chính, tạo ra áp suất thủy lực.\n2.\tPhân Phối Áp Suất Thủy Lực: Xi lanh chính phân phối áp suất thủy lực qua các đường dẫn phanh đến các caliper hoặc xi lanh bánh xe.\n3.\tTạo Ma Sát: Các má phanh hoặc guốc phanh tạo ma sát với các đĩa phanh hoặc trống phanh để làm chậm xe.\n4.\tTản Nhiệt: Các đĩa phanh và trống phanh tản nhiệt được tạo ra trong quá trình phanh để tránh quá nhiệt.\n5.\tNâng Cao An Toàn: Hệ thống ABS nâng cao an toàn bằng cách ngăn chặn khóa bánh xe và duy trì khả năng kiểm soát xe trong quá trình phanh mạnh.",
          "images": []
        }
      },
      "2": {
        "id": "dfb9244e-7d99-4507-9655-b773614b3bb9",
        "en": {
          "name": "Brake System",
          "content": "The brake system is an essential safety feature in any vehicle, responsible for slowing down or stopping the vehicle. Effective and reliable braking is critical for the safety of the vehicle and its occupants. Here is an overview of the main components and functions of a typical brake system:",
          "mainComponents": "1.\tBrake Pedal: The driver applies force to the brake pedal to initiate the braking process.\n2.\tMaster Cylinder: Converts the force from the brake pedal into hydraulic pressure.\n3.\tBrake Lines: Carry the hydraulic fluid from the master cylinder to the brake calipers or wheel cylinders.\n4.\tBrake Calipers: Clamp the brake pads against the rotors to create friction and slow down the vehicle (in disc brake systems).\n5.\tBrake Pads: Create friction against the rotors to slow down the vehicle.\n6.\tBrake Rotors: The discs that the brake pads clamp onto to create the necessary friction.\n7.\tBrake Drums: Used in drum brake systems; the brake shoes press against the drum to create friction.\n8.\tBrake Shoes: Press against the brake drums to slow down the vehicle.\n9.\tBrake Fluid: The hydraulic fluid that transmits force from the master cylinder to the brake calipers or wheel cylinders.\n10.\tAnti-lock Braking System (ABS): Prevents the wheels from locking up during hard braking to maintain steering control.",
          "functions": "1.\tForce Transmission: The brake pedal applies force to the master cylinder, creating hydraulic pressure.\n2.\tHydraulic Pressure Distribution: The master cylinder distributes hydraulic pressure through the brake lines to the calipers or wheel cylinders.\n3.\tFriction Generation: The brake pads or shoes create friction against the rotors or drums to slow down the vehicle.\n4.\tHeat Dissipation: The rotors and drums dissipate heat generated during braking to prevent overheating.\n5.\tSafety Enhancement: The ABS system enhances safety by preventing wheel lock-up and maintaining vehicle control during hard braking.",
          "images": []
        },
        "vi": {
          "name": "PHANH XE",
          "content": "Hệ thống phanh là một tính năng an toàn quan trọng trong bất kỳ phương tiện nào, chịu trách nhiệm làm chậm hoặc dừng xe. Hiệu quả và độ tin cậy của hệ thống phanh là cực kỳ quan trọng đối với sự an toàn của phương tiện và hành khách. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống phanh điển hình:",
          "mainComponents": "1.\tBàn Đạp Phanh: Người lái xe tác động lực lên bàn đạp phanh để bắt đầu quá trình phanh.\n2.\tXi Lanh Chính: Chuyển đổi lực từ bàn đạp phanh thành áp suất thủy lực.\n3.\tĐường Dẫn Phanh: Chuyển dẫn chất lỏng thủy lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n4.\tCaliper Phanh: Kẹp các má phanh vào các đĩa phanh để tạo ra ma sát và làm chậm xe (trong hệ thống phanh đĩa).\n5.\tMá Phanh: Tạo ma sát với các đĩa phanh để làm chậm xe.\n6.\tĐĩa Phanh: Các đĩa mà má phanh kẹp vào để tạo ra ma sát cần thiết.\n7.\tTrống Phanh: Được sử dụng trong hệ thống phanh tang trống; các guốc phanh ép vào trống để tạo ma sát.\n8.\tGuốc Phanh: Ép vào trống phanh để làm chậm xe.\n9.\tDầu Phanh: Chất lỏng thủy lực truyền lực từ xi lanh chính đến các caliper hoặc xi lanh bánh xe.\n10.\tHệ Thống Chống Bó Cứng Phanh (ABS): Ngăn chặn các bánh xe bị khóa cứng trong quá trình phanh mạnh để duy trì khả năng điều khiển lái.",
          "functions": "1.\tTruyền Lực: Bàn đạp phanh tác động lực lên xi lanh chính, tạo ra áp suất thủy lực.\n2.\tPhân Phối Áp Suất Thủy Lực: Xi lanh chính phân phối áp suất thủy lực qua các đường dẫn phanh đến các caliper hoặc xi lanh bánh xe.\n3.\tTạo Ma Sát: Các má phanh hoặc guốc phanh tạo ma sát với các đĩa phanh hoặc trống phanh để làm chậm xe.\n4.\tTản Nhiệt: Các đĩa phanh và trống phanh tản nhiệt được tạo ra trong quá trình phanh để tránh quá nhiệt.\n5.\tNâng Cao An Toàn: Hệ thống ABS nâng cao an toàn bằng cách ngăn chặn khóa bánh xe và duy trì khả năng kiểm soát xe trong quá trình phanh mạnh.",
          "images":[]
        }
      },
      "3": {
        "id": "1dfa7aca-1c32-4e04-8058-0bbee4c394e3",
        "en": {
          "name": "Catalytic Converter",
          "content": "A catalytic converter is an essential component of a vehicle's exhaust system, designed to reduce harmful emissions produced by the engine. It helps to convert toxic pollutants into less harmful emissions before they are released into the atmosphere. Here is an overview of the main components and functions of a typical catalytic converter:",
          "mainComponents": "1.\tCatalyst Substrate: Usually made of a ceramic or metallic honeycomb structure, providing a large surface area for the catalytic reactions.\n2.\tCatalytic Coating: Contains precious metals like platinum, palladium, and rhodium that facilitate the chemical reactions.\n3.\tOxygen Sensors: Monitor the oxygen levels in the exhaust gases to ensure optimal operation of the catalytic converter.\n4.\tHeat Shield: Protects the catalytic converter and surrounding components from the high temperatures generated during operation.",
          "functions": "1.\tReduction of Nitrogen Oxides (NOx): The catalytic converter reduces NOx emissions by breaking them down into nitrogen and oxygen.\n2.\tOxidation of Carbon Monoxide (CO): It converts carbon monoxide, a harmful gas, into carbon dioxide, which is less harmful.\n3.\tOxidation of Hydrocarbons (HC): Unburned hydrocarbons in the exhaust are converted into carbon dioxide and water.\n4.\tEmission Control: Overall, the catalytic converter helps in controlling the emissions of harmful gases, contributing to cleaner air and meeting regulatory standards.",
          "images":[]
        },
        "vi": {
          "name": "BỘ CHUYỂN ĐỔI XÚC TÁC",
          "content": "Bộ chuyển đổi xúc tác là một thành phần thiết yếu của hệ thống xả của xe, được thiết kế để giảm thiểu các khí thải độc hại do động cơ sinh ra. Nó giúp chuyển đổi các chất ô nhiễm độc hại thành các khí thải ít độc hại hơn trước khi chúng được thải ra môi trường. Dưới đây là tổng quan về các thành phần chính và chức năng của một bộ chuyển đổi xúc tác điển hình:",
          "mainComponents": "1.\tChất Nền Xúc Tác: Thường được làm từ cấu trúc tổ ong bằng gốm hoặc kim loại, cung cấp diện tích bề mặt lớn cho các phản ứng xúc tác.\n2.\tLớp Phủ Xúc Tác: Chứa các kim loại quý như bạch kim, palladium, và rhodium giúp xúc tác các phản ứng hóa học.\n3.\tCảm Biến Oxy: Giám sát mức độ oxy trong khí thải để đảm bảo hoạt động tối ưu của bộ chuyển đổi xúc tác.\n4.\tTấm Chắn Nhiệt: Bảo vệ bộ chuyển đổi xúc tác và các thành phần xung quanh khỏi nhiệt độ cao được sinh ra trong quá trình hoạt động.\n",
          "functions": "1.\tGiảm Thiểu Oxit Nitơ (NOx): Bộ chuyển đổi xúc tác giảm thiểu NOx bằng cách phá vỡ chúng thành nitơ và oxy.\n2.\tOxy Hóa Carbon Monoxide (CO): Chuyển đổi carbon monoxide, một loại khí độc hại, thành carbon dioxide, ít độc hại hơn.\n3.\tOxy Hóa Hydrocarbon (HC): Các hydrocarbon chưa cháy hết trong khí thải được chuyển đổi thành carbon dioxide và nước.\n4.\tKiểm Soát Khí Thải: Tổng thể, bộ chuyển đổi xúc tác giúp kiểm soát lượng khí thải độc hại, góp phần làm sạch không khí và đáp ứng các tiêu chuẩn quy định.",
          "images": []
        }
      },
      "4": {
        "id": "7bfc9399-92cd-4365-8126-061bdd93b60a",
        "en": {
          "name": "Exhaust System",
          "content": "The exhaust system is a crucial part of a vehicle, responsible for directing exhaust gases away from the engine and out of the vehicle. It plays a vital role in reducing emissions, enhancing engine performance, and minimizing noise. Here is an overview of the main components and functions of a typical automotive exhaust system:",
          "mainComponents": "1.\tExhaust Manifold: Collects exhaust gases from the engine cylinders and directs them into the exhaust pipe.\n2.\tOxygen Sensors: Monitor the level of oxygen in the exhaust gases to help the engine control the air-fuel mixture for optimal combustion.\n3.\tCatalytic Converter: Reduces harmful emissions by converting toxic gases (like carbon monoxide, nitrogen oxides, and hydrocarbons) into less harmful substances (like carbon dioxide and water).\n4.\tExhaust Pipes: Transport exhaust gases from the exhaust manifold through the catalytic converter and muffler, eventually releasing them out of the vehicle.\n5.\tMuffler: Reduces the noise produced by the exhaust gases as they exit the engine.\n6.\tResonator: Works with the muffler to further reduce noise and can also help in tuning the exhaust sound.\n7.\tTailpipe: The final section of the exhaust system, where the exhaust gases are released into the atmosphere.\n",
          "functions": "1.\tEmission Control: Reduces harmful pollutants from the exhaust gases to meet environmental regulations.\n2.\tNoise Reduction: Minimizes the noise produced by the exhaust gases through the muffler and resonator.\n3.\tEngine Performance: Enhances engine efficiency by effectively managing the flow of exhaust gases.\n4.\tHeat Dissipation: Safely dissipates the heat generated by the exhaust gases away from the engine and vehicle.\n",
          "images": []
        },
        "vi": {
          "name": "ỐNG XẢ",
          "content": "Hệ thống ống xả là một phần quan trọng của xe, chịu trách nhiệm dẫn khí thải ra khỏi động cơ và ra ngoài xe. Nó đóng vai trò quan trọng trong việc giảm khí thải, tăng hiệu suất động cơ và giảm tiếng ồn. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống ống xả ô tô điển hình:",
          "mainComponents": "1.\tỐng Xả Chính: Thu thập khí thải từ các xi lanh động cơ và dẫn chúng vào ống xả.\n2.\tCảm Biến Oxy: Giám sát mức độ oxy trong khí thải để giúp động cơ kiểm soát hỗn hợp nhiên liệu-không khí tối ưu cho quá trình đốt cháy.\n3.\tBộ Chuyển Đổi Xúc Tác: Giảm thiểu khí thải độc hại bằng cách chuyển đổi các khí độc (như carbon monoxide, oxit nitơ và hydrocarbon) thành các chất ít độc hại hơn (như carbon dioxide và nước).\n4.\tỐng Xả: Dẫn khí thải từ ống xả chính qua bộ chuyển đổi xúc tác và ống giảm âm, cuối cùng thải chúng ra khỏi xe.\n5.\tỐng Giảm Âm: Giảm tiếng ồn do khí thải sinh ra khi chúng thoát ra khỏi động cơ.\n6.\tỐng Cộng Hưởng: Hoạt động cùng với ống giảm âm để giảm thêm tiếng ồn và có thể giúp điều chỉnh âm thanh của hệ thống xả.\n7.\tỐng Xả Cuối: Phần cuối cùng của hệ thống xả, nơi khí thải được thải ra môi trường.",
          "functions": "1.\tKiểm Soát Khí Thải: Giảm các chất ô nhiễm độc hại từ khí thải để đáp ứng các quy định về môi trường.\n2.\tGiảm Tiếng Ồn: Giảm tiếng ồn do khí thải sinh ra thông qua ống giảm âm và ống cộng hưởng.\n3.\tTăng Hiệu Suất Động Cơ: Tăng hiệu quả động cơ bằng cách quản lý hiệu quả luồng khí thải.\n4.\tTản Nhiệt: Tản nhiệt an toàn sinh ra từ khí thải ra khỏi động cơ và xe.",
          "images": []
        }
      },
      "5": {
        "id": "30d466ed-d58f-4b8c-9660-aefb4564b6d0",
        "en": {
          "name": "Airbag System",
          "content": "The airbag system is a critical safety feature in vehicles, designed to protect occupants during a collision by providing a cushioning effect. The system rapidly inflates airbags in the event of a crash, reducing the risk of injury. Here is an overview of the main components and functions of a typical airbag system:",
          "mainComponents": "1.\tAirbags: Flexible fabric bags that inflate upon impact to provide a cushioning effect. Common types include frontal airbags, side airbags, curtain airbags, and knee airbags.\n2.\tCrash Sensors: Detect the force and severity of a collision and send signals to the airbag control unit to deploy the airbags.\n3.\tAirbag Control Unit (ACU): The central computer that processes signals from the crash sensors and determines when to deploy the airbags.\n4.\tInflator Units: Contain the gas-generating chemicals that rapidly inflate the airbags upon receiving a signal from the ACU.\n5.\tSeatbelts: Work in conjunction with airbags to restrain occupants and reduce movement during a crash, enhancing the effectiveness of the airbags.\n6.\tWarning Light: Located on the dashboard, it indicates the status of the airbag system and alerts the driver to any malfunctions.\n",
          "functions": "1.\tImpact Detection: Crash sensors detect a collision and send signals to the ACU.\n2.\tAirbag Deployment: The ACU processes the signals and triggers the inflator units to deploy the airbags.\n3.\tOccupant Protection: Inflated airbags provide a cushioning effect, reducing the impact force on occupants and minimizing injury risk.\n4.\tSystem Monitoring: The warning light monitors the airbag system's status and alerts the driver to any issues.\n",
          "images": []
        },
        "vi": {
          "name": "TÚI KHÍ",
          "content": "Hệ thống túi khí là một tính năng an toàn quan trọng trong các phương tiện, được thiết kế để bảo vệ hành khách trong quá trình va chạm bằng cách cung cấp một hiệu ứng đệm. Hệ thống này nhanh chóng bơm phồng các túi khí trong trường hợp xảy ra tai nạn, giảm nguy cơ chấn thương. Dưới đây là tổng quan về các thành phần chính và chức năng của một hệ thống túi khí điển hình:",
          "mainComponents": "1.\tTúi Khí: Các túi vải mềm dẻo bơm phồng khi va chạm để cung cấp hiệu ứng đệm. Các loại thông thường bao gồm túi khí phía trước, túi khí bên hông, túi khí rèm và túi khí đầu gối.\n2.\tCảm Biến Va Chạm: Phát hiện lực và mức độ nghiêm trọng của va chạm và gửi tín hiệu đến bộ điều khiển túi khí để kích hoạt túi khí.\n3.\tBộ Điều Khiển Túi Khí (ACU): Máy tính trung tâm xử lý tín hiệu từ các cảm biến va chạm và quyết định khi nào cần kích hoạt túi khí.\n4.\tBộ Bơm Phồng Túi Khí: Chứa các hóa chất sinh khí nhanh chóng bơm phồng túi khí khi nhận được tín hiệu từ ACU.\n5.\tDây Đai An Toàn: Hoạt động cùng với túi khí để giữ chặt hành khách và giảm chuyển động trong quá trình va chạm, tăng cường hiệu quả của túi khí.\n6.\tĐèn Cảnh Báo: Nằm trên bảng điều khiển, chỉ báo trạng thái của hệ thống túi khí và cảnh báo người lái về bất kỳ sự cố nào.\n",
          "functions": "1.\tPhát Hiện Va Chạm: Cảm biến va chạm phát hiện va chạm và gửi tín hiệu đến ACU.\n2.\tKích Hoạt Túi Khí: ACU xử lý các tín hiệu và kích hoạt bộ bơm phồng túi khí để bơm phồng túi khí.\n3.\tBảo Vệ Hành Khách: Túi khí bơm phồng cung cấp hiệu ứng đệm, giảm lực tác động lên hành khách và giảm nguy cơ chấn thương.\n4.\tGiám Sát Hệ Thống: Đèn cảnh báo giám sát trạng thái của hệ thống túi khí và cảnh báo người lái về bất kỳ vấn đề nào.\n",
          "images": []
        }
      },
      "6": {
        "id": "1d7f9954-ef1c-4f85-bd8f-8237de25d592",
        "en": {
          "name": "Suspension System",
          "content": "The car suspension system is a detailed system on the car that supports the entire car body. This is a system with features such as high durability, to ensure the vehicle is sturdy. Car suspension systems also need to ensure the ability to limit strong fluctuations. This will help the car operate more safely and stably. The suspension system helps the wheels move vertically, synchronized with the vehicle's body, helping the vehicle to be less bumpy when moving on the road.",
          "mainComponents": "•\tSuspension: (Treo) The system of springs, shock absorbers, and linkages that connects a vehicle to its wheels, allowing relative motion between the two.\n•\tSpring: (Lò xo) A component of the suspension system that absorbs shocks and supports the weight of the vehicle.\n•\tShock absorber: (Bộ giảm xóc) A device that dampens and absorbs shocks and vibrations.\n•\tControl arm: (Càng xe) A hinged suspension link between the chassis and the wheel, allowing movement and flexibility.\n•\tStrut: (Cần đòn) A structural component of the suspension system, combining the spring and shock absorber into a single unit.\n•\tSway bar (Anti-roll bar): (Thanh cân bằng) A component that reduces body roll and improves stability during cornering.\n•\tSuspension bushing: (Ống lót treo) A rubber or polyurethane component that cushions and isolates suspension parts from chassis vibrations.\n•\tRide height: (Độ cao xe) The vertical distance between the ground and a specified point on the vehicle, often adjustable in modern suspensions.\n•\tIndependent suspension: (Treo độc lập) A suspension system where each wheel is attached to the chassis independently, allowing for better handling and ride quality.\n•\tBeam axle: (Cầu rỗng) A suspension system where both wheels are connected to a single axle, typically found in rear-wheel-drive and some heavy-duty vehicles.\n•\tAir suspension: (Treo khí) A suspension system that uses compressed air to adjust ride height and stiffness.\n•\tActive suspension: (Treo chủ động) A suspension system with sensors and actuators that continuously adjust damping and ride height for optimal performance.\n•\tPassive suspension: (Treo bị động) A basic suspension system with fixed damping and ride height adjustments.",
          "functions": " The car suspension system plays many different roles for the vehicle such as: Bearing the weight of the entire vehicle, helping to absorb shock, creating a smooth feeling when the wheels roll. From the above functions, the wheel will oscillate vertically when moving. This system also helps the wheels generate more friction and have better traction.\n  Thanks to that, the car can easily handle situations such as changing direction, accelerating,... when traveling. The car suspension system also helps the car operate stably and smoothly, ensuring safety and creating the most comfort for the vehicle user.",
          "images": []
        },
        "vi": {
          "name": "HỆ THỐNG TREO",
          "content": "Hệ thống treo ô tô là hệ thống chi tiết trên xe có vai trò nâng đỡ cho toàn bộ phần thân xe. Đây là hệ thống có các đặc điểm như có độ bền cao, nhằm đảm bảo xe được chắc chắn. Các hệ thống treo trên ô tô cũng cần đảm bảo khả năng hạn chế sự dao động mạnh. Điều này sẽ giúp cho ô tô vận hành an toàn và ổn định hơn. Hệ thống treo giúp cho bánh xe chuyển động với phương thẳng đứng, đồng bộ cùng thân xe giúp xe đỡ bị dằn xóc hơn lúc di chuyển trên đường.",
          "mainComponents": "1.\tHệ thống treo: (Treo) Hệ thống lò xo, giảm chấn và các liên kết nối xe với các bánh xe, cho phép chuyển động tương đối giữa hai bánh.\n2.\tLò xo: (Lò xo) Là bộ phận của hệ thống treo có tác dụng hấp thụ chấn động và đỡ trọng lượng của xe.\n3.\tBộ giảm xóc: (Bộ giảm xóc) Là thiết bị làm giảm và hấp thụ các chấn động, rung động.\n4.\tTay điều khiển: (Càng xe) Là bản lề liên kết treo giữa khung xe và bánh xe, cho phép di chuyển linh hoạt.\n5.\tStrut: (Cần đòn) Là bộ phận cấu tạo của hệ thống treo, kết hợp lò xo và bộ giảm xóc thành một khối duy nhất.\n6.\tSway bar (Thanh chống lật): (Thanh cân bằng) Là bộ phận giúp giảm độ lắc của thân xe và cải thiện độ ổn định khi vào cua.\n7.\tỐng lót hệ thống treo: (Ống lót treo) Thành phần cao su hoặc polyurethane có tác dụng đệm và cách ly các bộ phận treo khỏi rung động của khung xe.\n8.\tChiều cao đi xe: (Độ cao xe) Khoảng cách thẳng đứng giữa mặt đất và một điểm xác định trên xe, thường có thể điều chỉnh được trong hệ thống treo hiện đại.\n9.\tHệ thống treo độc lập: (Treo độc lập) Hệ thống treo trong đó mỗi bánh xe được gắn độc lập vào khung xe, cho phép xử lý và chất lượng lái tốt hơn.\n10.\tTrục dầm: (Cầu rỗng) Là hệ thống treo trong đó cả hai bánh được kết nối với một trục duy nhất, thường thấy ở các xe dẫn động cầu sau và một số xe hạng nặng.\n11.\tHệ thống treo khí nén: (Treo khí) Là hệ thống treo sử dụng khí nén để điều chỉnh độ cao và độ cứng của xe.\n12.\tHệ thống treo chủ động: (Treo chủ động) Hệ thống treo với các cảm biến và cơ cấu chấp hành liên tục điều chỉnh giảm xóc và chiều cao xe để đạt hiệu suất tối ưu.\n13.\tHệ thống treo thụ động: (Treo thiết bị động) Hệ thống treo cơ bản với khả năng giảm chấn cố định và điều chỉnh chiều cao xe.\n",
          "functions": "Hệ thống treo ô tô giữ nhiều vai trò khác nhau cho xe như: Chịu tải sức nặng cho toàn xe, giúp giảm xóc, tạo cảm giác êm ái khi bánh lăn. Từ những công năng trên, bánh xe khi di chuyển sẽ dao động theo phương thẳng đứng. Hệ thống này cũng giúp cho bánh xe nảy sinh nhiều ma sát, có độ bám đường tốt hơn.\n\tNhờ đó xe có thể dễ dàng xử lý các tình huống như chuyển hướng, tăng tốc,... khi lưu thông. Hệ thống treo ô tô cũng giúp cho xe hơi vận hành ổn định, êm ái, đảm bảo an toàn và tạo ra sự thoải mái nhất cho người sử dụng xe.\n",
          "images": []
        }
      },
      "7": {
        "id": "d26faeb7-0e09-4a7d-bdd2-f76b85b68411",
        "en": {
          "name": "Wheel Drive System",
          "content": "A car's 4-wheel drive system is a system that transmits energy from the engine to the wheels to help the vehicle move. Equipping a suitable drive system will help the engine operate more powerfully. Depending on technical requirements, the vehicle can be equipped with a 1-wheel drive system (2 wheels) or 2 wheels (4 wheels). In this article, we will learn more about the four-wheel drive type in more detail.",
          "mainComponents": "•\tDrivetrain: (Hệ thống dẫn động) The components that transmit power from the engine to the wheels of a vehicle.\n•\tEngine: (Động cơ) The component of a vehicle that generates power by burning fuel.\n•\tTransmission: (Hộp số) A device that transfers power from the engine to the wheels, allowing the vehicle to change speed and direction.\n•\tClutch: (Lá côn) A device that engages and disengages the transmission from the engine to allow for gear changes.\n•\tDifferential: (Bộ chia tốc) A component that allows wheels to rotate at different speeds while providing equal torque.\n•\tAxle: (Trục cầu) A shaft on which a wheel rotates, often part of the drivetrain.\n•\tTransfer case: (Hộp đổi số) A device that distributes power from the transmission to front and rear axles in four-wheel-drive vehicles.\n•\tDrive shaft: (Trục dẫn động) A rotating shaft that transmits torque from the engine to the differential or axle.\n•\tAll-wheel drive (AWD): (Dẫn động bốn bánh) A drivetrain system that sends power to all four wheels of a vehicle for improved traction and stability.\n•\tFour-wheel drive (4WD): (Dẫn động bốn bánh) A system that allows the engine to power all four wheels simultaneously, typically used for off-road or low-traction conditions.\n•\tFront-wheel drive (FWD): (Dẫn động cầu trước) A drivetrain configuration where the engine's power is transmitted to the front wheels.\n•\tRear-wheel drive (RWD): (Dẫn động cầu sau) A drivetrain configuration where the engine's power is transmitted to the rear wheels.\n•\tTorque: (Momen xoắn) The rotational force produced by the engine and transmitted through the drivetrain to propel the vehicle.",
          "functions": "Includes 3 types:\nPart-time 4WD\n\nPart-time 4-wheel drive system with 2 drive modes on different terrain types\nThe 4WD part-time drive system has a simple structure, so the price is often cheaper and easier to operate than other types of four-wheel drive. In addition, compared to full-time drive systems, vehicles using this drive system often consume less fuel.\nCurrent 4WD part-time drive systems usually have 3 basic axle engagement modes:\n•Mode 2H: high-speed single-wheel drive, suitable for driving on normal paved roads.\n•4H mode:  high-speed 2-wheel drive, helping the vehicle overcome roads with slippery surfaces.\n• Mode 4L: slow-speed 2-wheel drive, often activated when traveling through muddy, steep, and rough roads.\nThanks to these bridging modes, vehicles using a part-time 4-wheel drive system can provide good support to overcome bad terrain. In addition, drivers can also improve their driving skills and proactively choose appropriate modes when driving on different terrain conditions.\n4WD part-time drive systems are usually not equipped with a center differential. Therefore, when the bridge is engaged in 4H or 4L mode, the two bridges will be rigidly connected and distribute torque to each wheel equally, and the 4 wheels will rotate at the same speed. This causes disadvantages when the vehicle is cornering, so it is not recommended for use when the road surface is dry or too hard.\nHowever, many car manufacturers have overcome this drawback by adding the option of a center differential. With this option, the vehicle usually has 4 bridging modes: 2H, 4H, 4HLc and 4LLc.\nAll-wheel drive (AWD)\nThis car's drive system is full-time because there is no active single-wheel mode, the torque is distributed to all 4 wheels. This is the type of 4WD drive system with center differential so it will have many advantages.\nVehicles with a 4-wheel permanent drive system inherit the advantages of the 4WD system, being able to move in all terrain conditions without having to choose a mode like part-time drive. Therefore, the driver only needs to focus on driving.\nThe vehicle's drive system is equipped with a center differential, which can distribute torque to the front and rear wheels in a certain ratio. Many drive systems also have the ability to balance dynamics, transferring power back and forth between the front and rear axle depending on slippage or cornering speed. Thanks to that, the vehicle can move well on hard, dry road surfaces and with many curves without having hard wheels or damaging equipment.\n\nPermanent 4WD has the ability to balance the dynamics between the front and rear axle quite well\nBecause of its complex construction and the need for a lot of equipment, the price of regular 4-wheel drive is often higher than part-time 4-wheel drive. In addition, vehicles using this drive system often consume more fuel than other types when operating.\nFull-time 4WD\nWith the 4WD full-time drive system, torque will be automatically distributed to the axles to increase traction. The driver can set the \"Auto 4WD\" mode so that the vehicle automatically activates or deactivates 4WD drive mode depending on weather and terrain conditions.\nWith the ability to automatically distribute torque to the axles, the driver will be able to focus on driving, without requiring too much control skills.\nAutomatic torque distribution has many advantages, but it also creates barriers for drivers when encountering terrain that is too difficult because they cannot control themselves when overcoming obstacles.\nAll-wheel drive (AWD)\nAWD (All Wheel Drive) is a type of 4-wheel drive of a car in which power is continuously transmitted to all wheels.\n.\nAWD drive is equipped on many high-end SUVs or Sedan models\nAWD is considered one of the smartest car drive systems with high technology, possessing many advantages.\nAWD can automatically redistribute torque to the most suitable axles to increase traction in necessary situations. Because this drive system will automatically distribute power from the engine to the wheels according to an algorithm in the ECU.\nNormally, torque is distributed in a ratio of 5% to the front axle and 95% to the rear axle. When encountering difficult terrain, the drive system will automatically transfer energy from the rear axle to the front axle so that traction is at the best level.\nIn addition, thanks to the flexible distribution of torque to the wheels according to terrain conditions, the vehicle operates very balanced, providing a smooth driving experience. Because there is no auxiliary gear lever, controlling the car is quite easy.\nThe AWD drive system is designed to be quite compact, so the car's chassis does not need to be high, and the car's size will be optimal. Fuel consumption is also more economical than some other drive types.",
          "images": []
        },
        "vi": {
          "name": "HỆ THỐNG DẪN ĐỘNG",
          "content": "Hệ dẫn động 4 bánh ô tô là một hệ thống truyền tải năng lượng từ động cơ tới bánh xe giúp xe di chuyển. Việc trang bị hệ dẫn động phù hợp sẽ giúp động cơ hoạt động mạnh mẽ hơn. Tùy thuộc vào yêu cầu kỹ thuật, xe có thể được trang bị hệ thống dẫn động 1 cầu (2 bánh) hoặc 2 cầu (4 bánh). Trong bài viết này, chúng ta sẽ tìm hiểu chi tiết hơn về loại dẫn động bốn bánh.",
          "mainComponents": "1.Hệ thống truyền động: (Hệ thống dẫn động) Là bộ phận truyền công suất từ động cơ đến các bánh xe của ô tô.\n2.Động cơ: (Động cơ) Bộ phận của phương tiện tạo ra năng lượng bằng cách đốt cháy nhiên liệu.\n3.Bộ truyền động: (Hộp số) Là thiết bị truyền lực từ động cơ tới các bánh xe, cho phép xe thay đổi tốc độ và hướng chuyển động.\n4.Clutch: (Lá công) Một thiết bị đóng và ngắt hộp số khỏi động cơ để cho phép chuyển số.\n5.Differential: (Bộ chia tốc độ) Là thành phần cho phép các bánh xe quay với tốc độ khác nhau đồng thời cung cấp mô men xoắn bằng nhau.\n6.Trục: (Trục cầu) Trục mà bánh xe quay trên đó, thường là một phần của hệ thống truyền động.\n7.Hộp chuyển số: (Hộp đổi số) Là thiết bị phân phối lực từ hộp số tới cầu trước và cầu sau trên xe dẫn động bốn bánh.\n8.Trục dẫn động: (Trục dẫn động) Là trục quay truyền mô men xoắn từ động cơ tới bộ vi sai hoặc trục xe.\n9. Dẫn động bốn bánh (AWD): (Dẫn động bánh bánh) Một hệ thống truyền động truyền lực tới cả bốn bánh của xe để cải thiện độ bám đường và độ ổn định.\n10.Dẫn động bốn bánh (4WD): (Dẫn động bánh bánh) Một hệ thống cho phép động cơ cung cấp năng lượng đồng thời cho cả bốn bánh, thường được sử dụng trong điều kiện địa hình hoặc lực kéo thấp.\n11.Dẫn động cầu trước (FWD): (Dẫn động cầu trước) Cấu hình hệ thống truyền động trong đó sức mạnh của động cơ được truyền tới các bánh trước.\n12. Dẫn động cầu sau (RWD): (Dẫn động cầu sau) Cấu hình hệ thống truyền động trong đó sức mạnh của động cơ được truyền tới các bánh sau.\n13. Mô-men xoắn: (Momen xoắn) Lực quay do động cơ tạo ra và truyền qua hệ thống truyền lực để đẩy xe.",
          "functions": "\tDẫn động 4 bánh bán thời gian (Part-time 4WD)\n \nHệ dẫn động 4 bánh bán thời gian với 2 chế độ dẫn động trên các loại địa hình khác nhau\nHệ dẫn động bán thời gian 4WD có cấu tạo đơn giản nên giá thành thường rẻ hơn, dễ thao tác hơn so với các loại dẫn động bốn bánh khác. Ngoài ra, so với hệ dẫn động toàn thời gian thì xe sử dụng hệ dẫn động này thường ít tốn xăng hơn.\nHệ dẫn động bán thời gian 4WD hiện nay thường có 3 chế độ gài cầu cơ bản:\n•\tChế độ 2H: dẫn động 1 cầu tốc độ cao, phù hợp khi chạy trên đường trải nhựa bình thường. \n•\tChế độ 4H:  dẫn động 2 cầu tốc độ cao, giúp xe vượt qua các đoạn đường có bề mặt trơn trượt. \n•\tChế độ 4L: dẫn động 2 cầu tốc độ chậm, thường kích hoạt khi di chuyển qua các đoạn đường bùn lầy, dốc cao, gồ ghề. \nNhờ các chế độ gài cầu này, xe sử dụng hệ dẫn động 4 bánh bán thời gian có thể hỗ trợ tốt để vượt qua các địa hình xấu. Ngoài ra, tài xế cũng được nâng cao kỹ năng lái, chủ động chọn chế độ phù hợp khi lái trên những điều kiện địa hình khác nhau.\nHệ dẫn động bán thời gian 4WD thường không trang bị vi sai trung tâm. Vì vậy, khi gài cầu ở chế độ 4H hay 4L, hai cầu sẽ được nối cứng và phân phối mô-men xoắn đến từng bánh đều nhau, 4 bánh xe sẽ quay cùng tốc độ. Điều này gây bất lợi khi xe vào cua nên không được khuyến cáo sử dụng khi mặt đường khô hay quá cứng.\nTuy nhiên, nhiều hãng sản xuất xe hơi đã khắc phục nhược điểm này bằng cách đưa thêm tùy chọn vi sai trung tâm. Với tùy chọn này, xe thường có 4 chế độ gài cầu là 2H, 4H, 4HLc và 4LLc.\n\tDẫn động tất cả các bánh (AWD)\nHệ dẫn động ô tô này thuộc kiểu toàn thời gian vì không có chế độ 1 cầu chủ động, mô-men xoắn được phân bố tới cả 4 bánh. Đây chính là loại hệ dẫn động 4WD có vi sai trung tâm nên sẽ có khá nhiều ưu điểm.\nXe sở hữu hệ dẫn động thường xuyên 4 bánh được thừa hưởng những lợi thế của hệ 4WD, có thể di chuyển trong mọi điều kiện địa hình mà không cần chọn chế độ như loại dẫn động bán thời gian. Do đó, tài xế chỉ cần tập trung cho việc điều khiển.\nHệ dẫn động của xe được trang bị vi sai trung tâm, có thể phân phối mô-men xoắn đến bánh trước và bánh sau theo tỷ lệ nhất định. Nhiều hệ dẫn động còn có khả năng cân bằng động lực, truyền năng lượng qua lại giữa cầu trước và cầu sau tùy thuộc vào độ trượt hoặc tốc độ vào cua. Nhờ đó, xe có thể di chuyển tốt trong điều kiện mặt đường cứng và khô, nhiều khúc cua mà không bị bánh cứng hay làm hỏng thiết bị.\n \nPermanent 4WD có khả năng cân bằng động lực giữa cầu trước và cầu sau khá tốt\nBởi vì cấu tạo phức tạp và cần nhiều thiết bị nên giá của dẫn động 4 bánh thường xuyên cao hơn loại 4 bánh bán thời gian. Ngoài ra, loại xe sử dụng hệ dẫn động này thường hao xăng hơn so với các loại khác khi vận hành.\nDẫn động 4 bánh toàn thời gian (Full-time 4WD)\nVới hệ dẫn động toàn thời gian 4WD, mô-men xoắn sẽ được tự động phân phối đến các trục để tăng độ bám đường. Người lái có thể cài đặt chế độ “Auto 4WD” để xe tự kích hoạt hoặc ngừng kích hoạt chế độ dẫn động 4WD tùy theo điều kiện thời tiết, địa hình.\nVới khả năng tự động phân bổ mô-men xoắn đến các trục, tài xế sẽ có thể tập trung lái xe, không đòi hỏi quá cao về kỹ năng điều khiển. \nViệc tự động phân bổ mô-men xoắn có nhiều lợi thế nhưng cũng đem đến rào cản cho tài xế khi gặp phải địa hình quá hiểm trở vì không thể tự chủ được khi vượt chướng ngại vật.\n Dẫn động tất cả các bánh (AWD)\nAWD (All Wheel Drive) là loại dẫn động 4 bánh của xe ô tô mà năng lượng liên tục được truyền đến tất cả các bánh\n. \n Dẫn động AWD được trang bị trên nhiều mẫu xe SUV hoặc Sedan cao cấp\nAWD được đánh giá là một trong những hệ dẫn động ô tô thông minh nhất với công nghệ cao, sở hữu rất nhiều ưu điểm.\nAWD có thể tự động phân bổ lại mô-men xoắn đến các cầu phù hợp nhất để tăng độ bám đường trong tình huống cần thiết. Bởi vì hệ dẫn động này sẽ tự động phân phối năng lượng từ động cơ đến bánh xe theo một thuật toán ở trong ECU. \nThông thường, các mô-men xoắn thường được phân phối theo tỷ lệ là 5% tới cầu trước và 95% tới cầu sau. Khi gặp địa hình khó, hệ dẫn động sẽ tự động chuyển bớt năng lượng từ cầu sau tới cầu trước sao cho độ bám đường ở mức tốt nhất.\nNgoài ra, nhờ phân bổ mô-men xoắn đến các bánh linh hoạt theo điều kiện địa hình mà xe vận hành rất cân bằng, mang lại trải nghiệm lái mượt mà. Vì không có cần số phụ nên việc điều khiển xe khá dễ dàng.\nHệ dẫn động AWD được thiết kế khá nhỏ gọn nên gầm xe không cần thiết kế cao, kích thước xe sẽ được tối ưu nhất. Mức tiêu hao nhiên liệu cũng tiết kiệm hơn so với một số kiểu dẫn động khác.",
          "images": []
        }
      },
      "id": "6009"
    }
  ]
}
